'use strict'

//дз №1

//№1

/*
let temp1 = +prompt("Введите значение температуры по Цельсию");
let temp2 = (9/5) * temp1 + 32;
alert(`Вот сколько это по Фаренгейту: ${temp2}`);
*/

//№2

/*
let admin;
let name = "Василий";
admin = name;
console.log(name);
*/

//№3

/*
let result = 10 + 10 + "10";
console.log(result);
*/

/*
1. первые две десятки складываются, так как обе являются числами, получаем 20
2. 20 конкатенируется с последней десяткой, так как именно она является строкой, получаем 2010
3. полученное значение записываем в переменную result
4. с помощью console.log выводим result в консоль
*/

//№4

let mode = "normal";  // является
let my_valu3 = 102; // является
//let 3my_value3 = "102"; // не является, так как в начале стоит число
let __hello__ = "world"; // является
let $$$ = "money"; // является 
//let !0_world = true; // не является, так как стоит восклицательый знак